<?php

namespace Database\Seeders;

use App\Models\QuestionCategory;
use Illuminate\Database\Seeder;

class QuestionCategorySeeder extends Seeder
{
    public function run(): void
    {
        $categories = [
            1 => 'ტერმინები',
            2 => 'მძღოლის უფლებები',
            3 => 'მაფრთხილებელი',
            4 => 'პრიორიტეტი',
            5 => 'მიმთითებელი',
            6 => 'ამკრძალავი',
            7 => 'დამატებითი',
            8 => 'საცნობი ნიშნები',
            9 => 'საინფორმაციო',
            10 => 'რევერსული ზოლი',
            11 => 'გზაზე გასვლა',
            12 => 'სასწავლო',
            13 => 'მონიშვნა',
            14 => 'შუქნიშანი',
            15 => 'გზაჯვარედინი',
            16 => 'ბავშვები',
            17 => 'სპეც-მანქანა',
            18 => 'მარეგულირებელი',
            19 => 'სამუხრუჭე',
            20 => 'მკვეთრი დამუხრუჭება',
            21 => 'ბუქსირება',
            22 => 'ავტომაგისტრალი',
            23 => 'უწესივრობა',
            24 => 'კანონმდებლობა',
            25 => 'ეკო-მართვა',
            26 => 'სიგნალები',
            27 => 'არასაკმარისი ხილვად.',
            28 => 'საავარიო',
            29 => 'სიჩქარე',
            30 => 'მეხრე',
            31 => 'ზოლებში მოძრაობა',
            32 => 'გასწრება',
            33 => 'რკინიგზა',
            34 => 'ქვეითი',
            35 => 'გაჩერება, დგომა',
            36 => 'სამედიცინო',
            37 => 'ჯარიმები',
            38 => 'არ დაგავიწყდეთ!',
            39 => 'დარწმუნდეს',
            40 => 'სამარშრუტო',
            41 => 'მასა',
            42 => 'მოპედი',
            43 => 'მოცურება',
            44 => 'ლოგიკური',
            45 => 'კონვენცია',
            46 => 'გადაზიდვები',
        ];

        foreach ($categories as $id => $name) {
            QuestionCategory::create([
                'id' => $id,
                'name' => $name,
            ]);
        }
    }
}
